package Two_Pointer_2;

public class about__Two_Pointer {

	//https://m.blog.naver.com/kks227/220795165570
	/**=====================================================================
	 * 단순히 이진탐색(binary search)알고리즘과 투 포인터(Two Poiters)알고리즘의 차이는.
	 * 
	 * 1. 이진탐색은 log n을 보장하고, 투 포인터는 최악의 경우 n이라고 할 수 있습니다.
	 * 
	 * 2. 이진탐색은 mid를 활용해서 매 연산마다 탐색하는 범위를 절반으로 좁혀나가는 반면에,
	 * 	   투 포인터는 양 끝단에서 한 칸씩 이동하면서 알맞은 값을 찾는 식으로 쓰이죠.
	 * 	   따라서 투 포인터는 left와 right가 중간 어디서 만날때까지 계속 탐색을 하게 될 것입니다.
	 * 
	 * 3. 이진탐색의 경우 탐색 대상 데이터가 정렬 되어있다는 가정하에 탐색을 하게 됩니다. 
	 * 	   투 포인터는 그런 제약이 없습니다.(필요할때도 있겠지만)   	
	 =======================================================================*/
}
